#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Test-Terraform-Labs/demo-github-actions/runs/run-nWYVTXCvaa5QcnEL

Waiting for the plan to start...

Terraform v1.1.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_pet.sg: Refreshing state... [id=peaceful-trout]
aws_security_group.web-sg: Refreshing state... [id=sg-0d61eebd6f69401af]
aws_instance.web: Refreshing state... [id=i-0c3716564ec616dfc]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_instance.web has changed
  ~ resource "aws_instance" "web" {
        id                           = "i-0c3716564ec616dfc"
      + tags                         = {}
        # (27 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_security_group.web-sg has changed
  ~ resource "aws_security_group" "web-sg" {
        id                     = "sg-0d61eebd6f69401af"
        name                   = "peaceful-trout-sg"
      + tags                   = {}
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.web must be replaced
-/+ resource "aws_instance" "web" {
      ~ arn                          = "arn:aws:ec2:us-east-1:249652974127:instance/i-0c3716564ec616dfc" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 1 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-0c3716564ec616dfc" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-0be1a83fe36d592a8" -> (known after apply)
      ~ private_dns                  = "ip-172-31-86-91.ec2.internal" -> (known after apply)
      ~ private_ip                   = "172.31.86.91" -> (known after apply)
      ~ public_dns                   = "ec2-18-204-194-98.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "18.204.194.98" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [
          - "peaceful-trout-sg",
        ] -> (known after apply)
      ~ subnet_id                    = "subnet-091bc38ce4e440585" -> (known after apply)
      - tags                         = {} -> null
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data                    = "5cf9f8552e74530df52fd091108fe1113c9e8a6a" -> "d5500c61bca8d94fdb6dff0ce4b711ffe1246079" # forces replacement
        # (5 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-066e7c03f4b129619" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ web-address = "ec2-18-204-194-98.compute-1.amazonaws.com:8080" -> (known after apply)
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pusher: @bogdantrifan, Action: `pull_request`*